---
kind: property
id: P:Autodesk.Revit.DB.XYZ.X
zh: 点
source: html/b4d890c1-d278-c8a0-c4c9-6dfe9c7e68df.htm
---
# Autodesk.Revit.DB.XYZ.X Property

**中文**: 点

Gets the first coordinate.

## Syntax (C#)
```csharp
public double X { get; }
```